
&НаКлиенте
Процедура ПоискВБазеЗнаний(Команда)
	
	ФормаПараметры = Новый Структура;
	ФормаПараметры.Вставить("Области", ЗаполнитьСписокНаСервере());
	
	ФормаИмя = "ОбщаяФорма.ФормаПоиска";
	ОткрытьФорму(ФормаИмя, ФормаПараметры, , Истина);
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ЗаполнитьСписокНаСервере()

	ОбластиПоиска = Новый СписокЗначений;
	ОбластиПоиска.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("База знаний (Справочник)"),"База знаний,База знаний,");
	
	Возврат ОбластиПоиска;

КонецФункции // ЗаполнитьСписокНаСервере()
 
