#Область ПрограммныйИнтерфейс

#Область Прочее

// Устанавливает значение переданного реквизита типа "ФорматированныйДокумент", получая данные из указанного
// хранилища значения
//
// Параметры:
//  Описание - форматированныйДокумент, который надо заполнить данными из хранилища значения
//  ХранилищеЗначения - хранилище значения, содержащее описание форматированного документа
//
Процедура УстановитьФорматированноеОписаниеИзХранилища(Описание, ХранилищеЗначения) Экспорт
	
	ДанныеХранилища = ХранилищеЗначения.Получить();
	Если ТипЗнч(ДанныеХранилища) = Тип("ФорматированныйДокумент") Тогда
		Описание = ДанныеХранилища;
	Иначе
		Описание = Новый ФорматированныйДокумент;
	КонецЕсли;
	
КонецПроцедуры

// Помещает указанное описание типа "ФорматированныйДокумент", в указанное хранилище значения
//
// Параметры:
//  Описание - форматированныйДокумент, который надо поместить в хранилище значения
//  ХранилищеЗначения - хранилище значения, в которое нужно поместить форматированное описание
//
Процедура ПоместитьФорматированноеОписаниеВХранилище(Описание, ХранилищеЗначения) Экспорт
	
	ХранилищеЗначения = Новый ХранилищеЗначения(Описание);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти