&НаСервере
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (ДокументОснование.Категория = Перечисления.КатегорииОбращений.ИзменениеКонфигурации ИЛИ ДокументОснование.Категория = Перечисления.КатегорииОбращений.ИзменениеКонфигурацииБезПодтвержденияОдобрения) Тогда
		Сообщить("Для создания изменения конфигурации категория обращения должна быть ""Бизнес системы -> ERP -> 1C -> Изменение конфигурации""");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(ИмяФайлаПоставки) Тогда
			Сообщить("Данные изменения зафиксированы в файле поставки "+СокрЛП(ИмяФайлаПоставки));
			Если НЕ(РольДоступна("ПолныеПрава")) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании()
	
	ТЗ = Изменения.Выгрузить();
	ТЗ.ЗаполнитьЗначения(Справочники.Релизы.ПустаяСсылка(),"Релиз");
	ТЗ.ЗаполнитьЗначения("","Версия");
	Изменения.Загрузить(ТЗ);
	Релиз = Справочники.Релизы.ПустаяСсылка();
	Состояние = Неопределено;
	ИмяФайлаПоставки = "";
	КомментарийХранилища = "";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Заказчик = ДанныеЗаполнения.Инициатор;
	Исполнитель = ДанныеЗаполнения.Ответственный;
	Конфигурация = ДанныеЗаполнения.Конфигурация;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Движения.ИзмененияКонфигурации.Записывать = Истина;
	Для Каждого ТекСтрокаИзменения Из Изменения Цикл
		Движение = Движения.ИзмененияКонфигурации.Добавить();
		Движение.Период = Дата;
		Движение.Заказчик = Заказчик;
		Движение.Исполнитель = Исполнитель;
		Движение.Конфигурация = Конфигурация;
		Движение.ДокументОснование = ДокументОснование;
		Движение.Состояние = Состояние;
		Движение.ОсновнойРелиз = Релиз;
		Движение.Версия = ТекСтрокаИзменения.Версия;
		Движение.ГруппаМетаданных = ТекСтрокаИзменения.ГруппаМетаданных;
		Движение.ОбъектМетаданных = ТекСтрокаИзменения.ОбъектМетаданных;
		Движение.Релиз = ТекСтрокаИзменения.Релиз;
		Движение.НомерСтрокиТЧ = ТекСтрокаИзменения.НомерСтроки;
		Движение.ПовышенныйРиск = ПовышенныйРиск;
	КонецЦикла;
КонецПроцедуры