Функция ПринятьДанные(Данные, ТекстОшибки)
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	ЗаписьЖурналаРегистрации("Обмен данными XML. Обработки.УниверсальныйОбменДаннымиXML.Создать",,,,"");
	ОбработкаОбмена.РежимОбмена = "Загрузка";
	
	РаботаВозможна = ОбработкаОбмена.ВыполнитьДействияПередЧтениемДанных(Данные.Получить());
	ЗаписьЖурналаРегистрации("Обмен данными XML. ОбработкаОбмена.ВыполнитьДействияПередЧтениемДанных",,,,"");
	
	Если НЕ РаботаВозможна Тогда
		ЗаписьЖурналаРегистрации("Обмен данными XML. НЕ РаботаВозможна",,,,"");
		Возврат 0;
	КонецЕсли;	

	ОбработкаОбмена.ПроизвестиЧтениеДанных(ТекстОшибки);
	ЗаписьЖурналаРегистрации("Обмен данными XML. ОбработкаОбмена.ПроизвестиЧтениеДанных",,,,"");
	
	ОбработкаОбмена.ВыполнитьДействияПослеЗавершенияЧтенияДанных(); 
	ЗаписьЖурналаРегистрации("Обмен данными XML. ОбработкаОбмена.ВыполнитьДействияПослеЗавершенияЧтенияДанных",,,,"");
	
	Возврат ОбработкаОбмена.мСчетчикЗагруженныхОбъектов;
КонецФункции
