
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	КодСообщения = Запись.Код;
	ДокументСообщения = Запись.Документ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СообщенияИУведомления.ТекстСообщения,
	               |	СообщенияИУведомления.Параметры
	               |ИЗ
	               |	РегистрСведений.СообщенияИУведомления КАК СообщенияИУведомления
	               |ГДЕ
	               |	СообщенияИУведомления.Документ = &Документ
	               |	И СообщенияИУведомления.Код = &Код" ;
				   
	Запрос.УстановитьПараметр("Документ", ДокументСообщения);
	Запрос.УстановитьПараметр("Код", КодСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыСУ = Выборка.Параметры.Получить();
		
		Если Найти(нрег(Выборка.ТекстСообщения),"<html>") > 0 и Найти(нрег(Выборка.ТекстСообщения),"</html>") > 0 Тогда
			ТекстПисьма = Выборка.ТекстСообщения;
		КонецЕсли;
		Получатель = Запись.Получатель;
		
		Если НЕ ПараметрыСУ = Неопределено Тогда
			Для Каждого Вложение из ПараметрыСУ.Вложения Цикл
				
				//Данные = Новый ХранилищеЗначения(Вложение.Данные);
				
				Если ТипЗнч(Вложение) = Тип("Структура") И (ТипЗнч(Вложение.Данные) = Тип("ДвоичныеДанные") ИЛИ ТипЗнч(Вложение.Данные) = Тип("ИнтернетПочтовоеСообщение")) И Не Вложение.Данные = Неопределено Тогда
					
					Строка = ТЗПрикрепленныеФайлы.Добавить();
					
					Строка.Название = Вложение.ИмяФайла;
					Адрес = ПоместитьВоВременноеХранилище(Вложение.Данные,ЭтаФорма.УникальныйИдентификатор); 
					Строка.Данные = Адрес; 
					
				КонецЕсли; 	
			КонецЦикла;  
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗПрикрепленныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТЗПрикрепленныеФайлы.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда 
		
		Если Прав(ТекДанные.Название, 3) = "msg" Тогда
			ТекстВопроса = НСтр("ru = 'Это вложение является почтовым сообщением MS Outlook. В данной программе оно не может быть открыто. Хотите получить копию почтового сообщения с этим вложением на свою почту?'");
			Оповещение = Новый ОписаниеОповещения("ОбработкаВопроса", ЭтотОбъект, Запись.ИсходныйКлючЗаписи);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Открытие вложения'"));
			Возврат;
		КонецЕсли; 
		
		#Если Не ВебКлиент Тогда
			ВрКаталог		= КаталогВременныхФайлов();
			ВрФайл			= "";
			
			ТекущаяСтрока = ЭтаФорма.Элементы.ТЗПрикрепленныеФайлы.ТекущиеДанные;
			
			ВрФайл = КаталогВременныхФайлов() + ТекущаяСтрока.Название;
			
			Если Не ПустаяСтрока(ВрФайл) И Не ТекущаяСтрока.Данные = Неопределено Тогда
				
				ПрикрФайл = ПолучитьИзВременногоХранилища(ТекущаяСтрока.Данные);
				
				Если ТипЗнч(ПрикрФайл) = Тип("ДвоичныеДанные") Тогда
					
					ПрикрФайл.Записать(ВрФайл);
					ЗапуститьПриложение(ВрФайл);
					
				КонецЕсли;
			КонецЕсли;
			
			#Иначе
				глПодключитьРасширениеРаботыСФайлами();
				
					
					ПрикрФайл = ПолучитьИзВременногоХранилища(ТекДанные.Данные);

					Если ТипЗнч(ПрикрФайл) = Тип ("ДвоичныеДанные") Тогда
						
						ПолучитьФайл(ТекДанные.Данные, ТекДанные.Название, Истина);
						
					КонецЕсли;
			#КонецЕсли  		
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопроса(Знач Результат, Знач ПараметрКоманды) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ТИ.СоздатьСообщениеПоЗапросу(ПараметрКоманды);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗПрикрепленныеФайлыСохранить(Команда)
	
	СтандартнаяОбработка = Ложь;

	#Если ВебКлиент Тогда
		глПодключитьРасширениеРаботыСФайлами();
	#КонецЕсли
		
	ТекДанные = Элементы.ТЗПрикрепленныеФайлы.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда 
		
			Если Прав(ТекДанные.Название, 3) = "msg" Тогда
				ТекстВопроса = НСтр("ru = 'Это вложение является почтовым сообщением MS Outlook. Из этой программы оно не может быть сохранено. Хотите получить копию почтового сообщения с этим вложением на свою почту?'");
				Оповещение = Новый ОписаниеОповещения("ОбработкаВопроса", ЭтотОбъект, Запись.ИсходныйКлючЗаписи);
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Сохранение вложения'"));
				Возврат;
			КонецЕсли; 
			
			Режим 	= РежимДиалогаВыбораФайла.Сохранение;
			Диалог 	= Новый ДиалогВыбораФайла(Режим);
			
			ПрикрФайл = ПолучитьИзВременногоХранилища(ТекДанные.Данные);
			
			Если ТипЗнч(ПрикрФайл) = Тип ("ДвоичныеДанные") Тогда
				ИмяФайла = ТекДанные.Название;
				
				ПолучитьФайл(ТекДанные.Данные,ТекДанные.Название, Истина);
				
			КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФайловоеРасширение(Команда)
	
	УстановитьРасширениеРаботыСФайлами();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда	
		Элементы.КнопкаПодключитьРасширениеРаботыСФайлами.Видимость = Истина;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщенияПовторно(Команда)
	
	Список = ВыбратьПолучателей();
	Если Список = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Статус = ОтправитьСообщение(ЭтаФорма.Запись.ИсходныйКлючЗаписи, Список );
	
	Если Статус <> "Сообщение отправлено" Тогда
		Сообщить(Статус);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ОтправитьСообщение(Сообщение,Список) 
	
	Возврат(ТИ.ПовторноеОтправлениеСообщений(Сообщение,Список));
	
КонецФункции


&НаКлиенте
Функция ВыбратьПолучателей()
	Отказ = Ложь;
	Если СтрДлина(Получатель) = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Нет ни одного получателя для выбора'"),,
			"Получатель",,
			Отказ);
		Возврат Неопределено;
		
	КонецЕсли;	
	
	СтрокаПолучатель = СокрЛП(СтрЗаменить(Получатель,";",Символы.ПС));
	
	СписокВыбора = Новый СписокЗначений;
	
	Для ш = 1 По СтрЧислоСтрок(СтрокаПолучатель) Цикл
		
		ТекАдрес = СтрПолучитьСтроку(СтрокаПолучатель,ш);
		
		Если СокрЛП(ТекАдрес) = "" Тогда
			
			Продолжить;
		         
		КонецЕсли;
		
		СписокВыбора.Добавить(ТекАдрес);
		
	КонецЦикла;    	
	
	ОтобранныйСписок = Новый СписокЗначений;
	
	Если СписокВыбора.Количество() = 1 Тогда
				
		ОтобранныйСписок.Добавить( СписокВыбора.Получить(0).Значение );
		Возврат ОтобранныйСписок;		
		
	ИначеЕсли СписокВыбора.Количество() = 0 ТОгда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Нет ни одного получателя для выбора'"),,
			"Получатель",,
			Отказ);
		Возврат Неопределено;
		
	КонецЕсли;
	
	ОтобранныйСписок = ТИ.ПолучитьСписокОтобранныйПользователем(СписокВыбора,"");
	
	Возврат ОтобранныйСписок;
	
КонецФункции


