
&НаКлиенте
Процедура ОтправитьСообщенияПовторно(Команда)
	
	МассивВыделенныхСообщений = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого Сообщение из МассивВыделенныхСообщений Цикл
		
		Статус = ОтправитьСообщение(Сообщение);
		
		Если Статус <> "Сообщение отправлено" Тогда
			Сообщить(Статус);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры


&НаСервере 
Функция ОтправитьСообщение(Сообщение) 
	
	Возврат(ТИ.ПовторноеОтправлениеСообщений(Сообщение));
	
КонецФункции

&НаКлиенте
Процедура кнУдалитьСообщение(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		УдалитьЗаписьНаСервере(Элементы.Список.ТекущаяСтрока);
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УдалитьЗаписьНаСервере(КлючЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.СообщенияИУведомления.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,КлючЗаписи);
	
	МенеджерЗаписи.Прочитать();
	
	Попытка
		
		МенеджерЗаписи.Удалить();
		
	Исключение
		
		Сообщить("Не удалось удалить запись по причине:" + ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры // УдалитьЗаписьНаСервере(Элементы.ТаблицаУведомлений.ТекущаяСтрока)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") и Параметры.Отбор.Свойство("Документ") Тогда
		
		//Элементы.ДатаРегистрации.Видимость = Ложь;
		//Элементы.НаличиеПрикрепленныхФайлов.Видимость = Ложь;
		//Элементы.Отправлено.Видимость = Ложь;
		
	КонецЕсли; 	
	
КонецПроцедуры