
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСППР.ПоместитьФорматированноеОписаниеВХранилище(Описание, ТекущийОбъект.ХранилищеОписания);
	ОбщегоНазначенияСППР.ПоместитьФорматированноеОписаниеВХранилище(Инструкция, ТекущийОбъект.ХранилищеИнструкции);
	ТекущийОбъект.Описание = Описание.ПолучитьТекст();
	ТекущийОбъект.Инструкция = Инструкция.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РедактируемыйОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбщегоНазначенияСППР.УстановитьФорматированноеОписаниеИзХранилища(Описание, РедактируемыйОбъект.ХранилищеОписания);
	ОбщегоНазначенияСППР.УстановитьФорматированноеОписаниеИзХранилища(Инструкция, РедактируемыйОбъект.ХранилищеИнструкции);
//	СсылкаНаФайлОписания
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Ответственный = ТИ.ТекущийПользователь();
	КонецЕсли; 
	
	ФайлТехническогоОписания = ТИ.ПолучитьФайлФункцииНаСервере(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ТехническоеОписание"));
	ФайлИнструкцииПользователя = ТИ.ПолучитьФайлФункцииНаСервере(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ИнструкцияПользователя"));
	
КонецПроцедуры
