&НаКлиенте
Процедура ТекстПисьмаДокументСформирован(Элемент)
	
	Если Элемент.Документ <> Неопределено и Элемент.Документ.Body <> Неопределено Тогда
		
		Элемент.Документ.Body.ContentEditable = "true";
		Элемент.Документ.body.scroll = "yes";
		Если СтрДлина(Объект.ТекстПисьма) > 0 Тогда
			Элемент.Документ.Body.innerHTML = Объект.ТекстПисьма;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстПисьма = Элементы.ТекстПисьма.Документ.activeElement.innerHTML;
	
	Объект.ТекстПисьма = 
	"<html>
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
	|<title></title>
	|</head>
	|<body>" 
	+ ТекстПисьма +
	"</body>
	|</html>";

КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактироватьHTML(Команда)
	ТекстПисьма = Элементы.ТекстПисьма.Документ.activeElement.innerHTML;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, Параметры);
	ПоказатьВводСтроки(Оповещение, ТекстПисьма, "Редактировать разметку письма на языке HTML:",, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
    Если НЕ Строка = Неопределено Тогда
		Элементы.ТекстПисьма.Документ.activeElement.innerHTML = Строка;
    КонецЕсли;
КонецПроцедуры;
