&НаСервере
Процедура УстановитьОтборПоПараметрам()
	
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("ПоКонфигурации", Параметры.Конфигурация);
	УстановитьОтборСписка(Список, ПараметрыОтбора, "ПоКонфигурации", "Конфигурация");
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора, ВидОтбора, ПолеОтбора)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
//		Список, ПолеОтбора, ПараметрыОтбора[ВидОтбора],,, ПараметрыОтбора[ВидОтбора] <> Неопределено И Не ПараметрыОтбора[ВидОтбора].Пустая());
		Список, ПолеОтбора, ПараметрыОтбора[ВидОтбора],,, ПараметрыОтбора[ВидОтбора] <> Неопределено);
	    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоПараметрам();
КонецПроцедуры
