
&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Если ПоказыватьСписок = Истина Тогда
		
		Элементы.ВнешнийОтчетОбработка.Видимость = Ложь;
		Элементы.ВнешниеОтчетыИОбработки.Видимость = Истина;
		
	Иначе
		
		Если Объект.ВнешниеОтчетыИОбработки.Количество() Тогда
			Оповещение = Новый ОписаниеОповещения("ОчисткаСписка", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Список обработок будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Очистка списка обработок'"));
		Иначе 
			Элементы.ВнешнийОтчетОбработка.Видимость = Истина;
			Элементы.ВнешниеОтчетыИОбработки.Видимость = Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаСписка(Ответ, ПараметрыВыполнения) Экспорт
	
	Если Ответ <> -1 Тогда
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ПерваяСтрока = Объект.ВнешниеОтчетыИОбработки[0];
			
			Объект.ВнешниеОтчетыИОбработки.Очистить();
			НоваяСтрока = Объект.ВнешниеОтчетыИОбработки.Добавить();
			НоваяСтрока.ВнешняяОбработка = ПерваяСтрока.ВнешняяОбработка;
			
			ВнешнийОтчетОбработка = ПерваяСтрока.ВнешняяОбработка;
			
			Элементы.ВнешнийОтчетОбработка.Видимость = Истина;
		    Элементы.ВнешниеОтчетыИОбработки.Видимость = Ложь;
			
		Иначе
			
			ПоказыватьСписок = Истина;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиПоКатегории();
	
	Если Лев(Объект.ОписаниеHTML,5) = "<html" Тогда
		Элементы.ОписаниеHTML.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	Иначе
		Элементы.ОписаниеHTML.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнийОтчетОбработкаПриИзменении(Элемент)
	
	Объект.ВнешниеОтчетыИОбработки.Очистить();
	НоваяСтрока = Объект.ВнешниеОтчетыИОбработки.Добавить();
	НоваяСтрока.ВнешняяОбработка = ВнешнийОтчетОбработка;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиПоКатегории()

	Если ЭтоНовый Тогда
		Элементы.Категория.ТолькоПросмотр = Ложь;
	КонецЕсли; 
	
	Если Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорииОбращений.ИзменениеКонфигурации") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорииОбращений.ИзменениеКонфигурацииБезПодтвержденияОдобрения") Тогда
		Элементы.ГруппаВнешниеОбработки.Видимость = Ложь;
		Элементы.Состояние.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ГруппаВнешниеОбработки.Видимость = Истина;
		Элементы.Состояние.ТолькоПросмотр = Истина;
		//Элементы.ФормаКнопка3.Видимость = Ложь;
		Если Объект.ВнешниеОтчетыИОбработки.Количество() > 1 Тогда
			ПоказыватьСписок = Истина;
			Элементы.ВнешнийОтчетОбработка.Видимость = Ложь;
			Элементы.ВнешниеОтчетыИОбработки.Видимость = Истина;
		Иначе
			Если Объект.ВнешниеОтчетыИОбработки.Количество() > 0 Тогда
				ВнешнийОтчетОбработка = Объект.ВнешниеОтчетыИОбработки[0].ВнешняяОбработка;
			КонецЕсли; 
			Элементы.ВнешнийОтчетОбработка.Видимость = Истина;
			Элементы.ВнешниеОтчетыИОбработки.Видимость = Ложь;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры // ()

&НаКлиенте
Процедура КатегорияОткрытие(Элемент, СтандартнаяОбработка)
	Если ТИ.ДоступнаРоль("ПолныеПрава") ИЛИ ТИ.ДоступнаРоль("Разработчик") Тогда
		Элементы.Категория.ТолькоПросмотр = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	УправлениеЭлементамиПоКатегории()
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = Объект.Ссылка.Пустая();
КонецПроцедуры
