Перем ПрошлыйИзмененныйРодительОбъектаДоступа;

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
		//НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
		
		#Если Клиент Тогда
		Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей Тогда
				
			// Сообщить о неуказанных табличных частей для заполнения.
			Для Каждого СтрокаПринадлежность Из Принадлежность Цикл
					
				Если ПустаяСтрока(СтрокаПринадлежность.ТабличнаяЧастьИмя) ИЛИ ПустаяСтрока(СтрокаПринадлежность.ТабличнаяЧастьПредставление) Тогда
					Сообщить("Не указана табличная часть для заполнения: " + СтрокаПринадлежность.ПредставлениеОбъекта, СтатусСообщения.Внимание);
				КонецЕсли;
					
			КонецЦикла;
				
		КонецЕсли;
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		//НастройкаПравДоступа.ОбновитьПраваДоступаКИерархическимОбъектамПриНеобходимости(Ссылка,ПрошлыйИзмененныйРодительОбъектаДоступа, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьТекущуюВерсию(ТекущаяВерсия) Экспорт 

	ЭтотОбъект.ТекущаяВерсия = ТекущаяВерсия;
	// Сменим индекс картинки, возможно, появилась версия или сменился индекс картинки у версии
//	ЭтотОбъект.ИндексКартинки = ТекущаяВерсия.ИндексКартинки;
	
	// копируем реквизиты для ускорения работы RLS
	ЭтотОбъект.ТекущаяВерсияРазмер = ТекущаяВерсия.Размер;
	ЭтотОбъект.ТекущаяВерсияДатаСоздания = ТекущаяВерсия.ДатаСоздания;
	ЭтотОбъект.ТекущаяВерсияАвтор = ТекущаяВерсия.Автор;
	ЭтотОбъект.ТекущаяВерсияРасширение = ТекущаяВерсия.Расширение;
	ЭтотОбъект.ТекущаяВерсияНомерВерсии = ТекущаяВерсия.НомерВерсии;
	ЭтотОбъект.ТекущаяВерсияКод = ТекущаяВерсия.Код;
	ЭтотОбъект.ТекущаяВерсияДатаМодификацииФайла = ТекущаяВерсия.ДатаМодификацииФайла;
	ЭтотОбъект.ТекущаяВерсияРазработчик = ТекущаяВерсия.ТекущийРазработчик;
	ЭтотОбъект.Записать();
	
КонецПроцедуры // ()
