
&НаКлиенте
Процедура ПроверитьWS(Команда)
	Сообщить(ВыполнитьПодключение(Элементы.Список.ТекущиеДанные.Ссылка));
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ВыполнитьПодключение(ИБ)
	
	// Подключение
		Попытка
			Определения = Новый WSОпределения(ИБ.WSСсылка, ИБ.WSПользователь, ИБ.WSПароль);
			ЗаписьЖурналаРегистрации("Обмен данными XML. Успех при создании WSОпределения.",,,,"База: "+ИБ+".");
			ТекстСообщения = "WSОпределение создано";
		Исключение
			ЗаписьЖурналаРегистрации("Обмен данными XML. Ошибка при создании WSОпределения.",,,,"База: "+ИБ+". "+ОписаниеОшибки());
			ТекстСообщения = "Ошибка при создании WSОпределения";
		КонецПопытки; 
		
		Попытка
			Прокси = Новый WSПрокси(Определения, "http://www.rusalco.com/xtdo", "WebRusAlco", "WebRusAlcoSoap");
			Прокси.Пользователь = ИБ.WSПользователь;
			Прокси.Пароль = ИБ.WSПароль;
			ЗаписьЖурналаРегистрации("Обмен данными XML. Успех при создании WSПрокси.",,,,"База: "+ИБ+". "+ОписаниеОшибки());
			ТекстСообщения = ТекстСообщения+"; WSПрокси создано";
		Исключение
			ЗаписьЖурналаРегистрации("Обмен данными XML. Ошибка при создании WSПрокси.",,,,"База: "+ИБ+". "+ОписаниеОшибки());
			ТекстСообщения = ТекстСообщения+"; Ошибка при создании WSПрокси";
		КонецПопытки;
		Возврат ТекстСообщения;
		
КонецФункции // ВыполнитьПодключение()
