&НаКлиенте
Процедура ОбработатьДокументы(Команда)
	ВыполнитьОбработку();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработку()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяФайлаПоставки", "");
	Запрос.УстановитьПараметр("Конфигурация", Объект.Конфигурация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзменениеВХранилище.Ссылка
	               |ИЗ
	               |	Документ.ИзменениеВХранилище КАК ИзменениеВХранилище
	               |ГДЕ
	               |	ИзменениеВХранилище.ИмяФайлаПоставки ПОДОБНО &ИмяФайлаПоставки
	               |	И ИзменениеВХранилище.Конфигурация = &Конфигурация";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	
	Для Каждого СтрокаТД Из ТаблицаДокументов Цикл
		Документ = СтрокаТД.Ссылка.ПолучитьОбъект();
		Документ.ИмяФайлаПоставки = Объект.ИмяФайлаПоставки;
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.Записать();
	КонецЦикла;
	
	Сообщить("Обработка завершена.");
КонецПроцедуры
