
&НаКлиенте
Процедура ПериодИзмененийПриИзменении(Элемент)
	Объект.ПериодИзмененийНачало = ПериодИзменений.ДатаНачала;
	Объект.ПериодИзмененийОкончание = ПериодИзменений.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПериодТестированияПриИзменении(Элемент)
	Объект.ПериодТестированияНачало = ПериодТестирования.ДатаНачала;
	Объект.ПериодТестированияОкончание = ПериодТестирования.ДатаОкончания;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодИзменений.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодИзменений.ДатаНачала = Объект.ПериодИзмененийНачало;
	ПериодИзменений.ДатаОкончания = Объект.ПериодИзмененийОкончание;
	
	ПериодТестирования.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодТестирования.ДатаНачала = Объект.ПериодТестированияНачало;
	ПериодТестирования.ДатаОкончания = Объект.ПериодТестированияОкончание;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()

	Если Объект.Владелец = ПредопределенноеЗначение("Справочник.Конфигурации.ЗарплатаИУправлениеПерсоналом") Тогда
		Элементы.Группа1.Видимость = Ложь;
	Иначе
		Элементы.Группа1.Видимость = Истина;
	КонецЕсли; 

КонецПроцедуры // УправлениеВидимостью()

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Владелец = ПредопределенноеЗначение("Справочник.Конфигурации.KT2000_Alcohol_Mnfc") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ПериодИзмененийНачало) ИЛИ НЕ ЗначениеЗаполнено(Объект.ПериодИзмененийОкончание) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Необходимо задать период изменений'"),,
			"Объект.ПериодИзменений",,
			Отказ);
			Возврат;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ПериодТестированияНачало) ИЛИ НЕ ЗначениеЗаполнено(Объект.ПериодТестированияОкончание) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Необходимо задать период тестирования'"),,
			"Объект.ПериодТестирования",,
			Отказ);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
