
&НаКлиенте
Процедура ПолучитьТаблицуЗначений(Команда)
	
	ТаблицаДанныхWS.Очистить();
	
	Get_Server();
	
КонецПроцедуры

&НаСервере
Функция Get_Server()
	
	Выполнить(Код);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МакетКодДляВыполнения = ПолучитьМакетНаСервере("КодДляВыполнения");
	Код = МакетКодДляВыполнения.ПолучитьТекст();
	КодПредставлениеHTML = ПолучитьHTMLПредставлениеКода(Код);
	
	ЗаполнитьСписокБазНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокБазНаСервере()
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    	"ВЫБРАТЬ
    	|	ИнформационныеБазы.BaseID,
    	|	ИнформационныеБазы.Наименование КАК ОписаниеБазы
    	|ИЗ
    	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
    	|ГДЕ
    	|	ИнформационныеБазы.BaseID <> """"
    	|
    	|УПОРЯДОЧИТЬ ПО
    	|	ИнформационныеБазы.Код";
	
    СписокБаз.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьСписокБазНаСервере()
 
&НаСервере 
Функция ПолучитьМакетНаСервере(ИмяМакета) 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	
	Возврат ОбработкаОбъект.ПолучитьМакет(ИмяМакета); 
	
КонецФункции

&НаКлиенте
Процедура СнятьПометки(Команда)

	Для каждого СтрокаБаза Из СписокБаз Цикл
		
		СтрокаБаза.Пометка = Ложь;
		
	КонецЦикла; 
	
КонецПроцедуры // УстановитьСнятьПометки()

&НаКлиенте
Функция ПолучитьHTMLПредставлениеКода(Знач _ИсходныйТекст)

	ТекстКода = СокрЛП(_ИсходныйТекст);

	//при переносе данных в строке могут появится 13-тые символы Юникода
	ТекстКода = СтрЗаменить(ТекстКода, Символ(13), "");
 
	ТекстКода = СтрЗаменить(ТекстКода, Символы.ПС, "\n");
	ТекстКода = СтрЗаменить(ТекстКода, """", "\""");

	Макет = ПолучитьМакетНаСервере("СкриптРаскрашивания");

	ТекстHTML = Макет.ПолучитьТекст();

	Стиль = "
		|.comment, .comment span, .comment span span, .comment span span span {color:green}
		|body {color:blue; font-family: \'Courier New\', Courier; font-size: 80%;}
		|p {padding: 0; margin: 2px 0px 2px 0px;}
		|.attribute {color:brown}
		|.number {color:black}
		|.string, .string span {color:black}
		|.datestring, .datestring span {color:magenta}
		|.sign {color:red}
		|.semicolon {color:red}
		|.macro {color:brown}
		|.operator {color:red}
		|.key {color:red}";

	ТекстHTML = СтрЗаменить(ТекстHTML, "#%&styles#%&", Стиль);
	ТекстHTML = СтрЗаменить(ТекстHTML, "#%&text#%&", "'" + ТекстКода + "'");

	Возврат ТекстHTML;
 
КонецФункции