#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
//	MOD Нач Кутья АА	
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для каждого Сеанс Из Сеансы Цикл
		Если Сеанс.НомерСеанса = НомерСеансаИнформационнойБазы() Тогда
			ТекущийСеанс = Сеанс;
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ ТекущийСеанс = Неопределено И НЕ ПредставлениеПриложения(ТекущийСеанс.ИмяПриложения) = "Фоновое задание" Тогда
		Если НЕ Пользователи.ТекущийПользователь().НеИспользоватьРазделение Тогда
			ПараметрыСеанса.КонфигурацияЗначение = Пользователи.ТекущийПользователь().ОсновнаяКонфигурация;
			ПараметрыСеанса.КонфигурацияИспользование = Истина;
		КонецЕсли; 
	КонецЕсли;
//	MOD Кон Кутья АА	
	
КонецПроцедуры

#КонецЕсли