#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ФормироватьЗадание Экспорт;

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		//ПользовательИнициатор = ТИ.ПолучитьПользователяПоФизЛицу(Инициатор.ФизЛицо, Инициатор._Логин, "Пользователь");
		//ПользовательОтветственный = ТИ.ПолучитьПользователяПоФизЛицу(Ответственный.ФизЛицо, Ответственный._Логин, "Сотрудник");
		
		ПользовательИнициатор = ТИ.ПолучитьПользователяПоФизЛицу(Инициатор.ФизЛицо, "Пользователь");
		ПользовательОтветственный = ТИ.ПолучитьПользователяПоФизЛицу(Ответственный.ФизЛицо, "Сотрудник");
		
		Если ПользовательИнициатор = Неопределено ИЛИ ПользовательОтветственный = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		//СтрокаHTML = "";
		//ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		//"СтандартныеПодсистемы.БизнесПроцессыИЗадачи\ПриОпределенииПредставленияПредметаВнешнейЗадачи");
		//Для каждого Обработчик Из ОбработчикиСобытия Цикл
		//	Обработчик.Модуль.ПриОпределенииПредставленияПредметаВнешнейЗадачи(Ссылка, СтрокаHTML);
		//КонецЦикла;
		//СодержаниеПредмета = Новый ХранилищеЗначения(СтрокаHTML, Новый СжатиеДанных());
		
		Если ФормироватьЗадание Тогда
			
			БП = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
			БП.Дата = ТекущаяДата();
			БП.Автор = ПользовательОтветственный;
			БП.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
			БП.Выполнено = Ложь;
			БП.Исполнитель = ПользовательОтветственный;
			БП.Наименование = "Тестирование внешней обработки";
			
			//		БП.НаПроверке = Истина;
			БП.НаПроверке = ТИ.ВыполнятьСогласование() И ВыполнятьСогласование;
			
			БП.Подтверждено = Ложь;
			БП.Предмет = Ссылка;
			БП.Проверяющий = ПользовательИнициатор;
			БП.Содержание = "Тестирование внешней обработки";
			БП.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен;
			//		БП.СрокИсполнения = ТекущаяДата()+ 86400*7;
			//		БП.АвторСтрокой = ПользовательОтветственный.Наименование;
			БП.ВнешнееЗадание = Ложь;
			//		БП.СодержаниеПредмета = СодержаниеПредмета;
			БП.Записать();
			БП.Старт();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьЗадачи = НЕ РезультатЗапроса.Пустой();
	
	ФормироватьЗадание = (ЭтоНовый() ИЛИ НЕ ЕстьЗадачи) И Категория = Перечисления.КатегорииОбращений.ИзменениеВнешнихОтчётовИОбработок;
	Если ЭтоНовый() Тогда 
		Пользователь = ТИ.ПолучитьПользователяПоФизЛицу(Ответственный.ФизЛицо, "Сотрудник");
		Конфигурация = Пользователь.ОсновнаяКонфигурация;
		ВыполнятьСогласование = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли