&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Файл Excel (*.xls, *.xlsx)|*.xls?";
	Если ДиалогВыбора.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция Сравнить(Команда)
	
	Макет = пМакет();
	ТабДокумент = Новый ТабличныйДокумент;
	ЗаполнитьОбластьМакета(ТабДокумент, Макет, "ЗаголовокОтчета");

	// Подключаемся к Excel документу
	ДокументExcel = Новый COMОбъект("Excel.Application"); 
	Книга=ДокументExcel.Application.Workbooks.Open(Объект.ПутьКФайлу);
	ТекЛист=Книга.WorkSheets(1);
	
	ActiveCell = ТекЛист.Cells.SpecialCells(11);
	КоличествоСтрок = ActiveCell.Row;
	КоличествоКолонок = ActiveCell.Column;
	НачальнаяСтрока = 4;
	Выводить = Ложь;
	ОбъектПоДаннымХранилища = "";
	ВыводимаяВерсия = "";
	
	Для НомерСтроки = НачальнаяСтрока По КоличествоСтрок Цикл
		
		ЗначениеКолонки1 = ТекЛист.Cells(НомерСтроки,1).Value;
		ЗначениеКолонки2 = ТекЛист.Cells(НомерСтроки,2).Value;
		
		Выводить = Ложь;
		
		Если Найти(ЗначениеКолонки1, "Версия:") > 0 Тогда
			Версия = ЗначениеКолонки2;
		ИначеЕсли Найти(ЗначениеКолонки1, "Пользователь:") > 0 Тогда
			Пользователь = ЗначениеКолонки2;
		ИначеЕсли Найти(ЗначениеКолонки1, "Дата создания:") > 0 Тогда
			ДатаСоздания = ЗначениеКолонки2;
		ИначеЕсли Найти(ЗначениеКолонки1, "Время создания:") > 0 Тогда
			ВремяСоздания = ЗначениеКолонки2;
		ИначеЕсли Найти(ЗначениеКолонки1, "Комментарий:") > 0 Тогда
			ДокументПоДаннымХранилища = ЗначениеКолонки2;
			СтруктураВозврата = НайтиДокумент(ЗначениеКолонки2);
			ДокументПоДаннымУчета = СтруктураВозврата.Документ;
			ВидОбъектаПоДаннымУчета = СтруктураВозврата.ВидОбъектаПоДаннымУчета;
			НаименованиеОбъектаПоДаннымУчета  = СтруктураВозврата.НаименованиеОбъектаПоДаннымУчета;
			ОбъектПоДаннымУчета = ВидОбъектаПоДаннымУчета+"."+НаименованиеОбъектаПоДаннымУчета;
		Иначе
			Если ЗначениеКолонки2 = "" ИЛИ ЗначениеКолонки2 = Неопределено Тогда Продолжить КонецЕсли;
			
			ПозицияТочки = Найти(ЗначениеКолонки2, ".");
			ВидОбъектаПоДаннымХранилища = Лев(ЗначениеКолонки2, ПозицияТочки-1);
			
			СтрокаПослеТочки = Прав(ЗначениеКолонки2, СтрДлина(ЗначениеКолонки2)-ПозицияТочки);
			ПозицияТочки = Найти(СтрокаПослеТочки, ".");
			Если ПозицияТочки = 0 Тогда
				НаименованиеОбъектаПоДаннымХранилища = СтрокаПослеТочки;
			Иначе
				НаименованиеОбъектаПоДаннымХранилища = Лев(СтрокаПослеТочки, ПозицияТочки-1);
			КонецЕсли;
			Если ОбъектПоДаннымХранилища = ВидОбъектаПоДаннымХранилища+"."+НаименованиеОбъектаПоДаннымХранилища И ВыводимаяВерсия = Версия Тогда
				Выводить = Ложь;
			Иначе
				ОбъектПоДаннымХранилища = ВидОбъектаПоДаннымХранилища+"."+НаименованиеОбъектаПоДаннымХранилища;
				ВыводимаяВерсия = Версия;
				Выводить = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Выводить Тогда
			Если НаименованиеОбъектаПоДаннымУчета = НаименованиеОбъектаПоДаннымХранилища Тогда
				Совпадение = Истина;
			Иначе
				Совпадение = Ложь;
			КонецЕсли;
				
			ЗаполнитьОбластьМакета(ТабДокумент, Макет, "Строка",ВыводимаяВерсия, ДатаСоздания, Пользователь, ДокументПоДаннымХранилища, ДокументПоДаннымУчета, ОбъектПоДаннымХранилища, ОбъектПоДаннымУчета, Совпадение);
		КонецЕсли;
			
	КонецЦикла;
		
	//*********** Отключаемся от Excel документа ***********
	ДокументExcel.Application.ActiveWorkbook.Close(False); 
	ДокументExcel.Application.Quit();
	
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.Показать();
КонецФункции

&НаСервере
Функция НайтиДокумент(Комментарий)
	НомерДок = Сред(Комментарий,23,9);
	Докум = Документы.ИзменениеВХранилище.НайтиПоНомеру(НомерДок);
	Если Докум = Документы.ИзменениеВХранилище.ПустаяСсылка() ИЛИ Докум = Неопределено Тогда
		ВидОбъектаПоДаннымУчета = "";
		НаименованиеОбъектаПоДаннымУчета = "";
		Докум = "";
	Иначе
		ВидОбъектаПоДаннымУчета = СокрЛП(Докум.ГруппаМетаданных);
		НаименованиеОбъектаПоДаннымУчета = СокрЛП(Докум.ОбъектМетаданных);
	КонецЕсли;
	
	СтруктураВозврарта = Новый Структура;
	СтруктураВозврарта.Вставить("Документ", Докум);
	СтруктураВозврарта.Вставить("ВидОбъектаПоДаннымУчета", ВидОбъектаПоДаннымУчета);
	СтруктураВозврарта.Вставить("НаименованиеОбъектаПоДаннымУчета", НаименованиеОбъектаПоДаннымУчета);
	
	Возврат СтруктураВозврарта;
КонецФункции

&НаСервере 
Функция пМакет() 
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет"); 
КонецФункции

&НаСервере 
Процедура ЗаполнитьОбластьМакета(ТабДокумент, Макет, ИмяОбласти, ВыводимаяВерсия="", ДатаСоздания="", Пользователь = "", ДокументПоДаннымХранилища = "", ДокументПоДаннымУчета = "", ОбъектПоДаннымХранилища = "", ОбъектПоДаннымУчета = "", Совпадение = Ложь) 
	Если ИмяОбласти = "ЗаголовокОтчета" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.ДатаОбработки = ТекущаяДата();
	Иначе
		Если Совпадение = Ложь Тогда
			Цетик = Новый Цвет(255,203,219);
		Иначе
			Цетик = Новый Цвет(255,255,255);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Область(1,2,1,9).ЦветФона = Цетик;
		ОбластьМакета.Параметры.ВыводимаяВерсия = ВыводимаяВерсия;
		ОбластьМакета.Параметры.ДатаСоздания = ДатаСоздания;
		ОбластьМакета.Параметры.Пользователь = Пользователь;
		ОбластьМакета.Параметры.ДокументПоДаннымХранилища = ДокументПоДаннымХранилища;
		ОбластьМакета.Параметры.ДокументПоДаннымУчета = ДокументПоДаннымУчета;
		ОбластьМакета.Параметры.ОбъектПоДаннымХранилища = ОбъектПоДаннымХранилища;
		ОбластьМакета.Параметры.ОбъектПоДаннымУчета = ОбъектПоДаннымУчета;
		ОбластьМакета.Параметры.Совпадение = Совпадение;
	КонецЕсли;
	
	//Возврат ОбластьМакета;
	ТабДокумент.Вывести(ОбластьМакета);
КонецПроцедуры