
&НаСервереБезКонтекста
Функция ПолучитьРелиз(ВидКонфигурации)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Релизы.ДатаРелиза КАК ДатаРелиза,
		|	Релизы.ПланируемаяДатаОбновленияРабочихБаз,
		|	Релизы.Наименование,
		|	Релизы.ПериодТестированияНачало,
		|	Релизы.ПериодТестированияОкончание
		|ИЗ
		|	Справочник.Релизы КАК Релизы
		|ГДЕ
		|	Релизы.ПометкаУдаления = ЛОЖЬ
		|	И Релизы.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаРелиза УБЫВ,
		|	Релизы.Код УБЫВ";
	
	Запрос.УстановитьПараметр("Владелец", ВидКонфигурации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрокаРелиза = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаРелиза = ВыборкаДетальныеЗаписи.Наименование+
		"; Дата выхода "+Формат(ВыборкаДетальныеЗаписи.ДатаРелиза, "ДФ=dd.MM.yy")+
		"; Период тестирования с "+Формат(ВыборкаДетальныеЗаписи.ПериодТестированияНачало, "ДФ=dd.MM.yy")+" по "+ Формат(ВыборкаДетальныеЗаписи.ПериодТестированияОкончание, "ДФ=dd.MM.yy")+
		"; Дата обновления рабочих баз "+Формат(ВыборкаДетальныеЗаписи.ПланируемаяДатаОбновленияРабочихБаз, "ДФ=dd.MM.yy");
	КонецЦикла;
	
	Возврат СтрокаРелиза;

КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьАдминистратораСистемы()

	Возврат Константы.АдминистраторСистемы.Получить();

КонецФункции // ПолучитьАдминистратораСистемы()

РелизКТ2000 = ПолучитьРелиз(ПредопределенноеЗначение("Справочник.Конфигурации.KT2000_Alcohol_Mnfc"));
//РелизЗУП = ПолучитьРелиз(ПредопределенноеЗначение("Справочник.Конфигурации.ЗарплатаИУправлениеПерсоналом"));
 
АдминистраторСистемы = ПолучитьАдминистратораСистемы();